[
	{
		"name": "GRIT Stringer",
		"color": [
			{
				"hexColor": "#252527",
				"colorName": "Black",
				"image": "https://cdn.shopify.com/s/files/1/1367/5207/files/BoldStringerGSBlack-GSOnyxGreyA1A5X-BB24-0738_a55885df-1a6d-41c1-8957-c89bcb7f62c6_1920x.jpg?v=1713881428"
			}
		],
		"description": "Maximize your workout potential with the Performance Gym Stringer from GRIT. Engineered for intense training sessions, this stringer features a lightweight, breathable fabric that keeps you cool and dry. The racerback design allows for unrestricted movement, while the athletic cut enhances your physique. Perfect for the gym or outdoor workouts, the Performance Gym Stringer combines functionality with sleek, minimalist style to help you perform at your best.",
		"categoryId": "04d813ca-0752-47b6-9c89-c776825d9e34",
		"image": "",
		"price": 1100,
		"segment": "MEN",
		"stock": 10,
		"sizes": ["M", "L"]
	},
	{
		"name": "GRIT Tank Top",
		"color": [
			{
				"hexColor": "#FFFFFF",
				"colorName": "White",
				"image": "https://i1.adis.ws/i/boohooamplience/bmm32518_white_xl?$product_image_main_mobile$&fmt=webp"
			},
			{
				"hexColor": "#BCCCD9",
				"colorName": "Grey",
				"image": "https://breadandboxersusa.com/pub_images/original/105-03_Man_Tank_ribbed_grey-melange_1.jpg?extend=copy&width=800&method=fit&height=1200&type=webp"
			}
		],
		"description": "Elevate your workout wardrobe with our Ribbed Fabric Tank Top. Designed for both comfort and style, this tank top features a flattering fit and flexible ribbed texture that moves with you. Perfect for intense gym sessions or casual wear, its breathable material ensures you stay cool and comfortable. Embrace the perfect blend of functionality and fashion with this versatile piece from GRIT.",
		"categoryId": "07d17f9f-f312-4ae1-8221-0e5b71bffb02",
		"image": "",
		"price": 899,
		"segment": "MEN",
		"stock": 10,
		"sizes": ["M", "L"]
	},
	{
		"name": "GRIT Body Suit",
		"color": [
			{
				"hexColor": "#252527",
				"colorName": "Black",
				"image": "https://media.very.ie/i/littlewoodsireland/V9VBD_SQ1_0000000004_BLACK_MDf?$300x400_retinamobilex2$"
			}
		],
		"description": "Discover the ultimate blend of style and comfort with the Seamless Bodysuit from GRIT. Designed with a sleek, form-fitting silhouette, this bodysuit is crafted from a soft, stretchy fabric that moves with you. Perfect for both workouts and everyday wear, it features a seamless construction that ensures a smooth, flattering look under any outfit. Whether you're at the gym, running errands, or layering it for a night out, the Seamless Bodysuit offers versatile style and unparalleled comfort.",
		"categoryId": "07d17f9f-f312-4ae1-8221-0e5b71bffb02",
		"image": "",
		"price": 1400,
		"segment": "WOMEN",
		"stock": 10,
		"sizes": ["S", "M", "L"]
	},
	{
		"name": "GRIT Polo",
		"color": [
			{
				"hexColor": "#252527",
				"colorName": "Black",
				"image": "https://underarmour.scene7.com/is/image/Underarmour/V5-1377374-001_FC?rp=standard-0pad%7CpdpMainDesktop&scl=1&fmt=jpg&qlt=85&resMode=sharp2&cache=on%2Con&bgc=F0F0F0&wid=566&hei=708&size=566%2C708"
			}
		],
		"description": "Combine style and performance with the Athleisure Polo Shirt from GRIT. Perfect for both active days and casual outings, this polo is made from premium, moisture-wicking fabric that keeps you cool and comfortable. Its modern, athletic fit and classic design, featuring a ribbed collar and button placket, make it a versatile addition to your wardrobe. Whether you're hitting the gym, running errands, or meeting friends, the Athleisure Polo Shirt delivers effortless style and functionality.",
		"categoryId": "07d17f9f-f312-4ae1-8221-0e5b71bffb02",
		"image": "",
		"price": 1200,
		"segment": "MEN",
		"stock": 10,
		"sizes": ["M", "L"]
	}
]
